print('1.(1)\n')
print('     (()__(()\n     /       \\\n    ( /    \\  \\\n     \\ o o    /\n     (_()_)__/ \\\n    / _,==._____ \\\n   (   |--|      )\n   /\\_.|__|\'-.__/\\_\n  / (        /     \\\n  \\  \\      (      /\n   )  \'._____)    /\n(((____.--(((____/\n')

print('\n')

print('(2)\n')
print('......  ......  ......  ..  ..\n......  ......  ......  ..  ..\n..         ..     ..    ..  ..\n..         ..     ..    ..  ..\n......     ..     ..    ..  ..\n......     ..     ..    ..  ..\n    ..     ..     ..    ..  ..\n    ..     ..     ..    ..  ..\n......  .....     ..    ......\n......  .....     ..    ......\n')

print('\n')

print('(3)\n')
print('*       \n    *   \n *      \n     *  \n  *     \n      * \n   *    \n       *\n')

print('\n')

print('(4)')
print("""                         忆江南
                  作者：白居易 年代：唐
江南好，风景旧曾谙。日出江花红胜火，春来江水绿如蓝。能不忆江南？ 
江南忆，最忆是杭州。山寺月中寻桂子，郡亭枕上看潮头。何日更重游？
江南忆，其次忆吴宫。吴酒一杯春竹叶，吴娃双舞醉芙蓉。早晚复相逢？""")

print('\n\n')

print('3.\n')
a, b, c = 3, 4, 3
s=(((a + b + c) / 2) * ((b + c - a) / 2) * ((a + c - b) / 2) * ((a + b - c) / 2))**0.5
print(s)

print('\n\n')

print('4.\n')
x1, y1 = 0.1, 0.1
x2, y2 = 0.3, 0.3
x3, y3 = 0.4, 0.5
S=(1 / 2) * ((x2 - x1) * (y3 - y1) - (x3 - x1) * (y2 - y1))
print(S)

print('\n\n')

print('5.\n')
a =1
b = 2
c = -1
x1 = (-b + (b ** 2 - 4 * a * c ) ** 0.5)/(2*a)
x2 = (-b - (b ** 2 - 4 * a * c ) ** 0.5)/(2*a)
print(x1,x2)

print('\n\n')

print('6.\n')
a, b, c = 1, 1, 1
min = (4 * a * c - b ** 2) / (4 * a)
print(min)
print('\n')
a, b, c = -1, 1, 1
max = (4 * a * c - b ** 2) / (4 * a)
print(max)